/**
*DOM ম্যানিপুলেশন চেকলিস্ট: 

এই চেকলিস্ট খুবই সিম্পল। এই কাজগুলো করার জন্য আগের করা কোন একটা HTML ফাইল নাও। ধরো আমরা penguin-fashion-tailwind নামে একটা প্রজেক্ট করছিলাম। কিছুদিন আগে। সেটা নিলেও হবে। এরপর নিচের জিনিসগুলো চেক করো। 

১. আমি যদি বলি কোন একটা এলিমেন্ট কে সিলেক্ট করে নিয়ে এসে console log করে দেখাতে হবে। তুমি কি সেটা করে দেখাতে পারবে? 

২. সেখানে একদম হেডার এ একটা buy now বাটন আছে। সেই বাটনে একটা ক্লিক হ্যান্ডলার যোগ করতে হবে? সেটা কি করতে পারবে? যদি পারো তাহলে সেই বাটনে ক্লিক করলে উপরে যেখানে BE THE PENGUIN এই কথাগুলো আছে সেখানে BE THE PENGUIN এর পরিবর্তে "I AM PENGUIN" কথাটা লিখে দিতে পারবে? 



এরপর নিচের দুইটা চ্যালেঞ্জ নিবে। 



.



চ্যালেঞ্জ নাম্বার ওয়ান 

নিজে নিজে আমাদের ভিডিও না দেখে বাপ এর ব্যাংক করে ফেলো। সম্ভব হলে মডিউল ২৭ এর মতো করে করো। আর একদম না পারলে মডিউল ২৬ এর মতো করে করো। তবে চ্যালেঞ্জ হচ্ছে তুমি চাইলে গুগলে সার্চ দিতে পারবে। কিন্তু আমাদের ভিডিও দেখতে পারবে না। তাহলে তুমি কোড করতে গিয়ে ঠেকে যাবে। এই ঠেকে যাওয়া আর ২-৩ ঘন্টা গুতায় গুতায় একটা জিনিস শেষ পর্যন্ত ফিনিশ করে ফেলাটাই তোমার লার্নিং। এইসব ফ্রাসট্রেশন এর মধ্যে ঘাম ঝরিয়ে ঝরিয়েই একজন ডেভেলপার তৈরি হয়।  



.

চ্যালেঞ্জ নাম্বার টু 

একটা ডিসকাউন্ট ক্যালকুলেটর এর প্রাকটিস দিয়েছি। সেটা করো। যেখানে একটা প্রাইস লেখা থাকবে এবং একটা বাটন আছে। সেটাতে ক্লিক করলে প্রাইস ৩০% কমে যাবে। এইটার আরেকটু এডভান্সড ভার্সন হবে। তুমি যেদিন Apply বাটনে ক্লিক করবে তখন যদি পাশের টেক্সট বক্স এ DOM লেখা থাকে তাহলে ডিসকাউন্ট কাজ করবে। প্রাইস ৩০% কমবে। আর যদি DOM না লিখে অন্য কিছু লিখে। যেমন ধরো dom বা drum বা অন্য কিছু। তাহলে ডিসকাউন্ট কাজ হবে না। 

.



চ্যালেঞ্জ নাম্বার থ্রি  

গুগলে সার্চ দাও। জাভাস্ক্রিপ্ট ক্যালকুলেটর। দেখবে এক এক সাইটে এক এক রকমের। এক এক জন এক এক ভাবে কোড করছে। সেটা ব্যাপার না। তোমার যেভাবে ভালো লাগে। সেভাবে খুঁজে খুঁজে বুঝে বুঝে করো। চোখ বন্ধ করে না। বরং বুঝে বুঝে করো। ফিউচারে কাজে লাগবে। 

 

.



উপরের দুইটা কাজ। আর এই দুইটা চ্যালেঞ্জ ১০০% করতে পারলে অবশ্যই ভালো। তবে ১০০% না হলে ৮০% হলেও করে ফেলো। 

 

.

আরো ডম ম্যানিপুলেশন: 

আগামীকাল আরেকটা মডিউল আসবে। সেখানে তোমাকে আরো দুইটা উদাহরণ দিয়ে সিমিলার জিনিস দেখানো হবে। যাতে তুমি জাভাস্ক্রিপ্ট এর কনসেপ্টগুলোর সাথে আরো কমফোর্টেবল হতে পারো। 



.

আজকের ঘাম, ফিউচারে দিবে আরাম। 



*/